<?php
	header("Content-Type:text/html;charset=utf-8");
	echo '时间限制: 1 Sec  内存限制: 128 MB
			题目描述
			定理：把一个至少两位的正整数的个位数字去掉，再从余下的数中减去个位数的5倍。当且仅当差是17的倍数时，原数也是17的倍数 。
			
			例如，34是17的倍数，因为3-20=-17是17的倍数；201不是17的倍数，因为20-5=15不是17的倍数。输入一个正整数n，你的任务是判断它是否是17的倍数。
			
			提示
			输入
			输入文件最多包含10组测试数据，每个数据占一行，仅包含一个正整数n（1<=n<=10100），表示待判断的正整数。n=0表示输入结束，你的程序不应当处理这一行。
			
			输出
			对于每组测试数据，输出一行，表示相应的n是否是17的倍数。1表示是，0表示否。
			
			样例输入
			
			34
			201
			2098765413
			1717171717171717171717171717171717171717171717171718
			0
			样例输出
			
			1
			0
			1
			0
			来源
			湖南省第六届大学生计算机程序设计竞赛<br><br><br>';


    echo '<hr>';
    $array = array('34','201','2098765413','1717171717171717171717171717171717171717171717171718','0');
    echo number($array);

    function number($num)
    {
    	$length = count($num);
    	for ($i = 0 ; $i < $length ; $i++)
    	{
    		if ($num[$i] < 10)
    			echo '输入的数字必须大于等于10<br>';
    		elseif (strstr($num[$i], '.'))
    			echo '输入的数字必须是整数<br>';
    		else
    		{
    			$last = $num[$i] % 10;
    			$num2 = ($num[$i] - $last) / 10;
    			if ($num[$i] % 17 == 0 && ($num2 - 5 * $last) % 17 == 0)
    				echo '1<br>';
    			else
    				echo '0<br>';
    		}
    		}
    	
    }
?>