<?php
header("Content-Type:text/html;charset=utf-8");

echo '<hr>';
//---------------------------------------------------------------------------------------------------------------------------------
//文件包含
//include '目标文件';
//require '目标文件';
// - 包含并运行指定文件
// - 被包含文件先按参数给出的路径寻找，如果没有给出目录（只有文件名）时则按照 include_path 指定的目录寻找
//- 如果在 include_path 下没找到该文件则 include 最后才在调用脚本文件所在的目录和当前工作目录下寻找
//- 如果最后仍未找到文件则 include 结构会发出一条警告；这一点和 require 不同，后者会发出一个"致命错误"

echo '<h2>包含并运行指定文件include require</h2>';
$b = 'b';
include 'include.php';
include 'include2.php';

echo $a.'<br>';

test();





echo '<hr>';
//---------------------------------------------------------------------------------------------------------------------------------

//文件包含
//include_once '目标文件';
//require_once '目标文件';
//
// - 两者的意义与include 和 require 的用法相同
//    - 使用带_once 的只会包含一次文件,可以避免函数重新定义,或者变量重新赋值

//文件包含相当于作用域相通
//include包含失败时会报警告错误
//require包含失败时会报致命错误

//include_once '目标文件';
//require_once '目标文件';
//文件包含,在包含前会事先检查文件是否被包含过,如果包含过,则后面不会继续包含

?>































<div style="height: 500px"></div>
