<?php
	header("Content-Type:text/html;charset=utf-8");
	//小朋友糖果----------------------------------------------------------------------------------------------------------------------------------------------------------
	$arrayChild = array(
		'小朋友1' => '0',
		'小朋友2' => '0',
		'小朋友3' => '0',
		'小朋友4' => '0',
		'小朋友5' => '0',
		'小朋友6' => '0',
		'小朋友7' => '0',
		'小朋友8' => '0',
		'小朋友9' => '0',
		'小朋友10' => '0',
		);
	$arrayCandy = range(1,99,1);

    foreach ($arrayCandy as $k => $v)
    {		
    	if ($k <10)
    	{
    		$j = $k + 1;
    		$arrayChild["小朋友$j"] += $v;
    	}else
    	{
    		$k = ($k + 1) - (intval(($k) / 10) * 10);    			
    		$arrayChild["小朋友$k"] += $v;
    	}

    }


	print_r($arrayChild);
?>